#+TITLE: Threads
#+AUTHOR: Astar Bahouidi
#+DESCRIPTION: Chapters 29-33 The Linux Programming Interface by Michael Kerrisk
#+STARTUP: showall

*** Exercise 31.2
Use thread-specific data to write thread-safe versions of =dirname()=
and =basename()= (Section 18.14).

For reference:

Execute code block with =C-c C-c= on code block then open result
buffer =*Man ...*=.

#+begin_src emacs-lisp
  (man "dirname(3)")
#+end_src

#+RESULTS:
: #<buffer *Man 3 dirname*>

